{
  "backend/main.mo": "Motoko canister implementing the HRMS backend with role-based access control, user profiles, employee records, onboarding tasks, goals, performance cycles, and reviews using in-memory Maps.",
  "feature_evidence.json": "Feature evidence report mapping implemented HRMS features (auth, employees, onboarding, performance) to frontend files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries of all major frontend files, describing their responsibilities across authentication, layout, employee management, onboarding, performance, and styling.",
  "frontend/index.css": "Global Tailwind CSS setup defining design tokens, color system, and light/dark theme variables for the HRMS portal.",
  "frontend/index.html": "Minimal HTML entry point that mounts the React application and loads the main TypeScript bundle.",
  "frontend/src/App.tsx": "Main React application wiring authentication, profile setup flow, layout, routing via TanStack Router, theming, and global providers.",
  "frontend/src/components/auth/LoginScreen.tsx": "Login screen UI that initiates Internet Identity authentication and shows branded loading and status states.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Modal dialog prompting first-time users to create their basic profile and saving it via backend mutation hooks.",
  "frontend/src/components/employees/EmployeeFormDialog.tsx": "Modal dialog component for creating or editing an employee profile, managing form state and submitting via create/update employee query hooks.",
  "frontend/src/components/feedback/AccessDenied.tsx": "Presentational component that displays an access denied message with an icon and a button to navigate back to the dashboard.",
  "frontend/src/components/layout/AppLayout.tsx": "Main application layout providing header, navigation, responsive sidebar, and logout handling, with navigation items filtered by admin status.",
  "frontend/src/components/onboarding/OnboardingTaskEditor.tsx": "Editor component for creating, editing, and assigning onboarding tasks to an employee, including dynamic task lists and submission to the backend.",
  "frontend/src/components/performance/GoalFormDialog.tsx": "Dialog component for adding new performance goals or updating goal progress and status, supporting both controlled and triggered open states.",
  "frontend/src/components/performance/ReviewEditors.tsx": "Component rendering self, manager, and HR review editors with role-based access and submission via corresponding review mutation hooks.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches a backend actor based on the current Internet Identity, initializes access control, and invalidates dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook to manage Internet Identity authentication, including login, logout, identity persistence, and login status tracking using DFINITY AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines a large set of React Query hooks for fetching and mutating backend data (users, employees, onboarding tasks, goals, reviews, roles) via the actor, with caching, invalidation, and toast notifications.",
  "frontend/src/index.css": "Sets up Tailwind CSS layers and defines extensive CSS variables for light and dark themes, including colors, layout tokens, and global base styles.",
  "frontend/src/main.tsx": "Application entry point that renders the React app, wiring up React Query and Internet Identity providers and importing global styles.",
  "frontend/src/pages/dashboard/DashboardPage.tsx": "Implements the main dashboard UI showing personalized welcome text, onboarding progress, and quick navigation cards based on employee data and admin status.",
  "frontend/src/pages/employees/EmployeeDetailPage.tsx": "Displays detailed information for a single employee, including personal and employment details, with edit capabilities gated by admin permissions.",
  "frontend/src/pages/employees/EmployeeDirectoryPage.tsx": "Admin-only page for searching, listing, and creating employees, featuring a searchable table, loading states, and access control.",
  "frontend/src/pages/employees/MyProfilePage.tsx": "Renders the logged-in employee’s profile by fetching their employee ID and details, showing loading and empty states. Displays personal information, job details, start date, and employment status using cards and badges.",
  "frontend/src/pages/onboarding/OnboardingAdminPage.tsx": "Admin-only page for managing onboarding tasks, allowing selection of an employee from a list. Renders an onboarding task editor for the selected employee and blocks access for non-admin users.",
  "frontend/src/pages/onboarding/OnboardingEmployeePage.tsx": "Employee-facing onboarding page that lists assigned onboarding tasks, shows overall progress, and allows task status updates. Handles loading, empty-task states, overdue detection, and progress visualization.",
  "frontend/src/pages/performance/GoalsPage.tsx": "Displays performance goals for the current employee, with admins able to select other employees and add goals. Shows goal status, progress, and handles loading and empty states.",
  "frontend/src/pages/performance/ReviewsPage.tsx": "Manages performance reviews and review cycles, with admin capabilities to create cycles and reviews for employees. Supports employee selection, cycle selection, and displays reviews with dialogs for creation.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters from query strings or hash routes and persisting them in sessionStorage. Includes helpers for storing, retrieving, clearing, and sanitizing URL/session parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration enabling class-based dark mode, scanning frontend sources, and extending the theme with OKLCH-based design tokens, custom colors, typography, animations, container settings, and UI primitives for an HRMS design system.",
  "project_state.json": "Project metadata describing an HRMS portal, including schema/versioning and a list of implemented features covering authentication with roles, employee data management, onboarding, performance modules, navigation structure, and visual theming."
}