{
  "backend/main.mo": "Defines the main HRMS backend actor with authorization mixin, employee data models, onboarding tasks, goals, performance cycles, reviews, questionnaire responses, appraisal details, and in‑memory maps with ID generation.",
  "backend/migration.mo": "Provides data‑migration logic and type conversions for upgrading employee profiles, adding externalEmployeeId support, and transforming old actor state into the new format.",
  "feature_evidence.json": "Lists feature‑evidence entries linking features to affected frontend files, components, test IDs, and confidence metadata.",
  "frontend-file-summaries.txt": "Contains autogenerated 1–2 sentence summaries for numerous frontend files describing each component's purpose and key behaviors.",
  "frontend/index.css": "Defines Tailwind base layers and full CSS variable theme tokens for light and dark mode, applying global background and text styles.",
  "frontend/index.html": "Minimal HTML entry point loading the React application via main.tsx.",
  "frontend/src/App.tsx": "Root React app configuring router, authentication, auto profile creation, access gate flow, and layout routing for all HRMS modules.",
  "frontend/src/components/auth/AccessGateScreen.tsx": "Collects first and last name before proceeding to Internet Identity login, showing validation errors and allowing reset.",
  "frontend/src/components/auth/LoginScreen.tsx": "Provides a sign‑in button using Internet Identity and displays login status.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Dialog for initial user profile setup, allowing entry of name and optional email before saving.",
  "frontend/src/components/employees/EmployeeFormDialog.tsx": "Dialog for creating or editing an employee record with fields for personal and job details and submit handling.",
  "frontend/src/components/feedback/AccessDenied.tsx": "Displays an access‑denied message for unauthorized users with a button to return to the dashboard.",
  "frontend/src/components/layout/AppLayout.tsx": "Main application layout with navigation, user menu, admin‑aware links, and logout handling.",
  "frontend/src/components/onboarding/OnboardingTaskEditor.tsx": "Editor for creating and assigning onboarding tasks to an employee, supporting add, remove, and update actions.",
  "frontend/src/components/performance/GoalFormDialog.tsx": "Dialog component for creating or updating employee goals, handling form state and submitting mutations for adding goals or updating progress.",
  "frontend/src/components/performance/ReviewEditors.tsx": "Allows employees, managers, and HR to edit and submit different review sections, with conditional UI based on admin role and review status.",
  "frontend/src/components/search/GlobalSearchBar.tsx": "Admin-only global search bar that debounces input, fetches search results, and navigates to the relevant employee, onboarding, or performance pages.",
  "frontend/src/hooks/useAccessGate.ts": "Manages a simple localStorage-backed access gate, storing a completion flag and user name with methods to complete or reset the gate.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor instance tied to Internet Identity, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity authentication, including identity loading, login, logout, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks wrapping backend API calls for user profiles, roles, employees, onboarding, goals, reviews, appraisals, and search operations.",
  "frontend/src/index.css": "Defines Tailwind layers, theme variables for light/dark mode, and utility component styles including background and readable-surface elements.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider and imports global styles.",
  "frontend/src/pages/dashboard/DashboardPage.tsx": "Renders the user dashboard with hero section, quick stats, onboarding progress, and navigation cards.",
  "frontend/src/pages/employees/EmployeeDetailPage.tsx": "Displays detailed employee info with admin edit options and handles loading and not-found states.",
  "frontend/src/pages/employees/EmployeeDirectoryPage.tsx": "Provides an admin-only searchable employee directory with creation and detail navigation.",
  "frontend/src/pages/employees/MyProfilePage.tsx": "Shows the logged-in user's employee profile with loading and empty-state handling.",
  "frontend/src/pages/onboarding/OnboardingAdminPage.tsx": "Admin page for selecting employees and managing their onboarding tasks, including questionnaire navigation.",
  "frontend/src/pages/onboarding/OnboardingEmployeePage.tsx": "Displays an employee's onboarding tasks, progress, status updates, and load/error states using data query hooks.",
  "frontend/src/pages/onboarding/OnboardingQuestionnairePage.tsx": "Manages onboarding questionnaire flow, including loading questions, capturing responses, admin employee selection, and submitting answers.",
  "frontend/src/pages/performance/AppraisalPage.tsx": "Loads and displays performance appraisal details for an employee, with admin employee selection and sample appraisal creation.",
  "frontend/src/pages/performance/GoalsPage.tsx": "Shows performance goals for an employee, supports admin employee switching, and provides a dialog to add new goals.",
  "frontend/src/pages/performance/ReviewsPage.tsx": "Handles viewing employee review cycles, creating new cycles and reviews, and admin employee selection.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters (including hash routes), storing/retrieving them in sessionStorage, and syncing URL params to session persistence.",
  "frontend/tailwind.config.js": "Defines Tailwind CSS configuration with custom colors, container settings, fonts, animations, and plugin integrations.",
  "project_state.json": "Tracks project state, issues, and feature requests for an employee appraisal app, including profile loading, appraisal data, and onboarding questionnaire problems."
}