{
  "kind": "build_request",
  "title": "Seed Jayesh Deshmukh employee + appraisal data and fix onboarding questionnaire loading",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add backend seed logic to guarantee that an employee profile for \"Jayesh Deshmukh\" exists and can be auto-resolved after sign-in, so that logging in with the access-gate name \"Jayesh Deshmukh\" no longer results in an empty profile page.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "I will give u the data plsss  add the data",
          "Onboarding question showing loading and the employee data of jayesh deshmukh is not there",
          "Empty profile page"
        ]
      },
      "acceptanceCriteria": [
        "If no employee record exists for the normalized name \"jayesh deshmukh\", the backend creates a default employee profile for Jayesh Deshmukh.",
        "After sign-in (with stored name \"Jayesh Deshmukh\"), calling getMyEmployeeId() returns Jayesh’s employeeId (auto-linking works) and My Profile no longer shows the empty-state card.",
        "The seed operation is idempotent (repeated calls do not create duplicates)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Store and display the provided external Employee ID \"EMP1024\" as part of the employee profile data model, and ensure it is included in the seeded Jayesh Deshmukh employee record.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Employee ID: EMP1024"
        ]
      },
      "acceptanceCriteria": [
        "Backend EmployeeProfile includes a dedicated text field for the external employee identifier (e.g., \"EMP1024\").",
        "The seeded Jayesh Deshmukh employee record has external employee ID set to \"EMP1024\".",
        "Frontend employee profile views (My Profile and Employee Detail) display the external employee ID value \"EMP1024\" (in English) when present.",
        "If the app is upgraded from existing state, persisted employee records remain readable after the schema update (add/upgrade migration as needed per the project’s conditional migration policy)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Seed the provided performance appraisal details for Jayesh Deshmukh (appraisal period April 2025 – March 2026) into the backend and ensure the Appraisal UI can load and display it for Jayesh.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Employee Performance Appraisal Details",
          "Appraisal Period: April 2025 – March 2026",
          "Performance Percentage: 85%",
          "Performance Grade: Grade A",
          "Increment Given: 10% salary increment",
          "Reason: Consistent performance and positive contribution to the organization",
          "The organization mainly evaluates employees based on: Work efficiency; Quality of output; Discipline and punctuality; Team coordination; Willingness to learn and improve",
          "Feedback Shared with Employee: Appreciated for dedication and consistency; Encouraged to improve leadership and decision-making skills; Advised to take more initiative in HR activities"
        ]
      },
      "acceptanceCriteria": [
        "Backend appraisal details storage contains a record for Jayesh’s employeeId with: department \"Human Resources\", job title \"HR Executive\", appraisal period \"April 2025 – March 2026\", work completion 85, quality \"Good and accurate\", timeliness \"Meets deadlines regularly\", teamwork \"Works well with team members\", communication \"Clear and professional\", overall rating 85, grade \"Grade A\", appraisal type \"Annual Performance Appraisal\", increment 10, reason \"Consistent performance and positive contribution to the organization\", criteria list (5 items), feedback list (3 items).",
        "The appraisal seed operation is idempotent and does not overwrite non-seed changes unless explicitly intended (e.g., only create if missing).",
        "Opening the Performance → Appraisal page for Jayesh’s employeeId shows the seeded appraisal data instead of an empty/loading state."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Replace the backend onboarding questionnaire questions with the exact provided list (10–15 questions; use the full provided list of 15), and ensure the onboarding questionnaire screen loads reliably without getting stuck on loading for non-admin users.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Onboarding Process – Sample Questions (10–15 Only)\nWhat is your full name?\nWhat is your age and date of birth?\nWhat is your marital status?\nWhat is your contact number and email ID?\nWhat is your current address?\nWhat is your highest educational qualification?\nWhich position/designation are you joining for?\nWhich department will you work in?\nWhat is your date of joining?\nDo you have any prior work experience? (Yes/No)\nWho will be your reporting manager?\nWhat are your key skills related to this job?\nHave you read and understood company rules and policies?\nAre you comfortable with company working hours and location?\nDo you agree to provide correct information and follow company guidelines?",
          "Onboarding stays on loading and shows nothing"
        ]
      },
      "acceptanceCriteria": [
        "Backend getOnboardingQuestions() returns exactly the 15 provided questions, in the same order, with English text.",
        "For a non-admin user, visiting /onboarding/questionnaire loads questions and renders the questionnaire form without calling admin-only employee search APIs.",
        "The questionnaire page shows a clear English empty/error state if prerequisites are missing (e.g., no resolved employeeId), rather than appearing to load indefinitely.",
        "Submitting questionnaire responses succeeds for the logged-in employee (once employeeId is resolved) and previously submitted responses render correctly under “Previous Submissions”."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor (all logic in backend/main.mo).",
    "Do not edit files under frontend/src/components/ui (read-only).",
    "Do not edit frontend immutable paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui.",
    "Use English for all user-facing UI text."
  ],
  "nonGoals": [
    "Implementing third-party authentication providers (only Internet Identity is supported).",
    "Adding an external database or integrating with non-IC storage services.",
    "Building real-time features (WebSockets/push notifications)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}