{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Employee external ID display + reliable Appraisal and Onboarding Questionnaire loading",
  "requirements": [
    {
      "id": "REQ-2",
      "summary": "Display the external Employee ID (e.g., EMP1024) in employee profile views when present.",
      "acceptanceCriteria": [
        "Frontend employee profile views (My Profile and Employee Detail) display the external employee ID value \"EMP1024\" (in English) when present."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/employees/MyProfilePage.tsx",
          "operation": "modify",
          "description": "Render an additional read-only field labeled \"External Employee ID\" when employee.externalEmployeeId is present, showing the external ID in English (e.g., \"EMP1024\"). Keep existing internal Employee ID display unchanged."
        },
        {
          "path": "frontend/src/pages/employees/EmployeeDetailPage.tsx",
          "operation": "modify",
          "description": "Render an additional read-only field labeled \"External Employee ID\" when employee.externalEmployeeId is present, showing the external ID in English (e.g., \"EMP1024\"). Keep existing internal Employee ID display unchanged."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Ensure the Appraisal page reliably loads and displays appraisal data for the resolved employee, with clear states when prerequisites are missing.",
      "acceptanceCriteria": [
        "Opening the Performance → Appraisal page for Jayesh’s employeeId shows the seeded appraisal data instead of an empty/loading state."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/performance/AppraisalPage.tsx",
          "operation": "modify",
          "description": "Improve prerequisite handling so the page does not appear stuck when myEmployeeId is not resolved (non-admin) or no employee is selected (admin). Show a clear English empty/error state when displayEmployeeId is missing, and ensure loading states are tied to the appraisal query status. Keep seeded appraisal display behavior intact (when backend returns data, render it)."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Adjust query hooks used by the Appraisal page (if needed) to expose/consume loading and error states consistently (e.g., ensure actor dependency and employeeId prerequisites are reflected accurately in the query enabled/isLoading state), so the UI can render clear non-loading fallbacks when employeeId is absent."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Make the onboarding questionnaire load reliably for non-admin users by avoiding admin-only data fetching and adding clear loading/empty/error states.",
      "acceptanceCriteria": [
        "For a non-admin user, visiting /onboarding/questionnaire loads questions and renders the questionnaire form without calling admin-only employee search APIs.",
        "The questionnaire page shows a clear English empty/error state if prerequisites are missing (e.g., no resolved employeeId), rather than appearing to load indefinitely.",
        "Submitting questionnaire responses succeeds for the logged-in employee (once employeeId is resolved) and previously submitted responses render correctly under “Previous Submissions”.",
        "Backend getOnboardingQuestions() returns exactly the 15 provided questions, in the same order, with English text."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Update the employee search query hook(s) to support an explicit enabled/guard parameter (or add a dedicated admin-only variant) so pages can avoid calling employee search for non-admin users. This supports the authorization component’s role-based access expectations; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/onboarding/OnboardingQuestionnairePage.tsx",
          "operation": "modify",
          "description": "Refactor the page to avoid triggering employee search for non-admin users (use the updated enabled/guarded hook behavior). Add explicit English UI states: (1) questions loading, (2) questions fetch error, (3) missing resolved employeeId for non-admin (tell the user their profile/employee link is not ready and to contact HR), and (4) admin-without-selection prompt. Ensure the form renders when questions are present and displayEmployeeId is resolved. This aligns with the authorization component guidance (admin-only data should not be fetched by non-admins); verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/onboarding/OnboardingAdminPage.tsx",
          "operation": "modify",
          "description": "Update any usage of the employee search hook to use the new enabled/guarded behavior where appropriate, ensuring admin-only screens continue to work while non-admin routes avoid admin-only backend capabilities. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/performance/AppraisalPage.tsx",
          "operation": "modify",
          "description": "Update any usage of the employee search hook to use the new enabled/guarded behavior so non-admin users do not call admin-only employee search while viewing their own appraisal. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/performance/GoalsPage.tsx",
          "operation": "modify",
          "description": "Update any usage of the employee search hook to use the new enabled/guarded behavior so non-admin users do not call admin-only employee search while viewing their own goals. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/employees/EmployeeDirectoryPage.tsx",
          "operation": "modify",
          "description": "Adjust employee search hook usage (if applicable) to match the updated hook signature/behavior while keeping the directory admin-only flow intact. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}